zephyrproject-rtos/zephyr/tests/drivers/cordic/cordic_api/src/test_stm32_cordic.c
/*
 * Copyright (c) 2024 Alexander Kozhinov <ak.alexander.kozhinov@gmail.com>
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/kernel.h>
#include <zephyr/ztest.h>
#include <zephyr/drivers/cordic.h>
#include <zephyr/device.h>
#include <zephyr/sys/atomic.h>
#include <math.h>

#include <zephyr/dsp/types.h>
#include <zephyr/dsp/utils.h>

#include <zephyr/drivers/dma.h>
#include <zephyr/devicetree/dma.h>

#include <stm32_ll_cordic.h>

#include <test_cordic_api_helpers.h>


#define CORDIC_NODE	DT_NODELABEL(cordic)
#define CORDIC_LL_DEV	((CORDIC_TypeDef *)DT_REG_ADDR(CORDIC_NODE))

static const struct device *const cordic_dma_wr_dev = \
	DEVICE_DT_GET_OR_NULL(DT_DMAS_CTLR_BY_NAME(CORDIC_NODE, cordic_write));
static const uint32_t cordic_dma_wr_channel = DT_DMAS_CELL_BY_NAME_OR(CORDIC_NODE, cordic_write, channel, 0);
static const uint32_t cordic_dma_wr_slot = DT_DMAS_CELL_BY_NAME_OR(CORDIC_NODE, cordic_write, slot, 0);

static const struct device *const cordic_dma_rd_dev = \
	DEVICE_DT_GET_OR_NULL(DT_DMAS_CTLR_BY_NAME(CORDIC_NODE, cordic_read));
static const uint32_t cordic_dma_rd_channel = DT_DMAS_CELL_BY_NAME_OR(CORDIC_NODE, cordic_read, channel, 0);
static const uint32_t cordic_dma_rd_slot = DT_DMAS_CELL_BY_NAME_OR(CORDIC_NODE, cordic_read, slot, 0);

static const struct device *const cordic_dev = DEVICE_DT_GET(CORDIC_NODE);
static atomic_t test_cordic_read_result_callback_call_cnt = ATOMIC_INIT(0);

#define RESULTS_FROM_CALLBACK_LEN	2  /* Max number of results per CORDIC function */
static int results_from_callback[RESULTS_FROM_CALLBACK_LEN];

/* The value of the error is the smallest value satisfying error over all the tests */
#define RESIDUAL_ERROR	((double)1e-4)


void test_cordic_read_result_callback(const struct device *dev,
									  const int *result,
									  const size_t result_len)
{
	ARG_UNUSED(dev);

	for(size_t i = 0; i < result_len && i < RESULTS_FROM_CALLBACK_LEN; i++) {
		results_from_callback[i] = result[i];
	}

	atomic_inc(&test_cordic_read_result_callback_call_cnt);
}


static uint32_t ll_scale2scale(const uint32_t ll_scale) {
	uint32_t scale = 0;

	switch(ll_scale) {
		case LL_CORDIC_SCALE_0:
			scale = CORDIC_DATA_SCALE_0;
			break;
		case LL_CORDIC_SCALE_1:
			scale = CORDIC_DATA_SCALE_1;
			break;
		case LL_CORDIC_SCALE_2:
			scale = CORDIC_DATA_SCALE_2;
			break;
		case LL_CORDIC_SCALE_3:
			scale = CORDIC_DATA_SCALE_3;
			break;
		case LL_CORDIC_SCALE_4:
			scale = CORDIC_DATA_SCALE_4;
			break;
		case LL_CORDIC_SCALE_5:
			scale = CORDIC_DATA_SCALE_5;
			break;
		case LL_CORDIC_SCALE_6:
			scale = CORDIC_DATA_SCALE_6;
			break;
		case LL_CORDIC_SCALE_7:
			scale = CORDIC_DATA_SCALE_7;
			break;
		default:
			scale = CORDIC_DATA_SCALE_0; // invalid value
			break;
	}

	return scale;
}

/**
 * @brief Perform CORDIC conversion from float to fixed point.
 * This is a helper function considering specific mapping
 * of CORDIC functions to results and their formats.
 */
static int stm32_cordic_float2fixed(const float *arg_in,
								    int *arg_out,
								    const size_t arg_in_len,
								    const size_t arg_out_len)
{
	const uint32_t ll_fn = LL_CORDIC_GetFunction(CORDIC_LL_DEV);
	const uint32_t ll_scale = LL_CORDIC_GetScale(CORDIC_LL_DEV);
	int ret = 0;

	float arg_in_tmp[arg_in_len];
	for(int i = 0; i < arg_in_len; i++) {
		arg_in_tmp[i] = arg_in[i];
	}

	switch(ll_fn) {
		case LL_CORDIC_FUNCTION_MODULUS:
			break;
		case LL_CORDIC_FUNCTION_PHASE:
			break;
		case LL_CORDIC_FUNCTION_COSINE:
		case LL_CORDIC_FUNCTION_SINE:
			arg_in_tmp[0] /= PI_F32;
			break;
		case LL_CORDIC_FUNCTION_SQUAREROOT:
			break;
		case LL_CORDIC_FUNCTION_HARCTANGENT:
		case LL_CORDIC_FUNCTION_ARCTANGENT:
		case LL_CORDIC_FUNCTION_NATURALLOG:
		case LL_CORDIC_FUNCTION_HCOSINE:
		case LL_CORDIC_FUNCTION_HSINE:
			for(int i = 0; i < arg_in_len; i++) {
				/* Divide by 2^scale */
				arg_in_tmp[i] /= (1 << ll_scale2scale(ll_scale));
			}
			break;
		default:
			return -EINVAL;
	}

	if(LL_CORDIC_GetOutSize(CORDIC_LL_DEV) == LL_CORDIC_INSIZE_32BITS) {
		for(int i = 0; i < arg_in_len; i++) {
			arg_out[i] = zdsp_f32_to_q31_shift(arg_in_tmp[i], 0);
		}
	} else {
		for(int i = 0; i < arg_in_len; i++) {
			arg_out[i] = zdsp_f32_to_q15_shift(arg_in_tmp[i], 0);
		}
	}

	switch(ll_fn) {
		case LL_CORDIC_FUNCTION_MODULUS:
			break;
		case LL_CORDIC_FUNCTION_PHASE:
			break;
		case LL_CORDIC_FUNCTION_COSINE:
			break;
		case LL_CORDIC_FUNCTION_SINE:
			break;
		case LL_CORDIC_FUNCTION_ARCTANGENT:
			break;
		case LL_CORDIC_FUNCTION_HARCTANGENT:
			break;
		case LL_CORDIC_FUNCTION_NATURALLOG:
			break;
		case LL_CORDIC_FUNCTION_SQUAREROOT:
			break;
		case LL_CORDIC_FUNCTION_HCOSINE:
			break;
		case LL_CORDIC_FUNCTION_HSINE:
			break;
		default:
			return -EINVAL;
	}

	return ret;
}

/**
 * @brief Perform CORDIC conversion from fixed point to float.
 * This is a helper function considering specific mapping
 * of CORDIC functions to results and their formats.
 */
static int stm32_cordic_fixed2float(const int *arg_in,
								    float *arg_out,
								    const size_t arg_in_len,
								    const size_t arg_out_len)
{
	const uint32_t ll_fn = LL_CORDIC_GetFunction(CORDIC_LL_DEV);
	const uint32_t ll_scale = LL_CORDIC_GetScale(CORDIC_LL_DEV);
	int ret = 0;

	int arg_in_tmp[arg_in_len];
	for(int i = 0; i < arg_in_len; i++) {
		arg_in_tmp[i] = arg_in[i];
	}

	switch(ll_fn) {
		case LL_CORDIC_FUNCTION_MODULUS:
			break;
		case LL_CORDIC_FUNCTION_PHASE:
			break;
		case LL_CORDIC_FUNCTION_COSINE:
			break;
		case LL_CORDIC_FUNCTION_SINE:
			break;
		case LL_CORDIC_FUNCTION_ARCTANGENT:
			break;
		case LL_CORDIC_FUNCTION_HARCTANGENT:
			break;
		case LL_CORDIC_FUNCTION_NATURALLOG:
			break;
		case LL_CORDIC_FUNCTION_SQUAREROOT:
			break;
		case LL_CORDIC_FUNCTION_HCOSINE:
			break;
		case LL_CORDIC_FUNCTION_HSINE:
			break;
		default:
			return -EINVAL;
	}

	if(LL_CORDIC_GetOutSize(CORDIC_LL_DEV) == LL_CORDIC_INSIZE_32BITS) {
		for(int i = 0; i < arg_in_len; i++) {
			arg_out[i] = zdsp_q31_to_f32_shift(arg_in_tmp[i], 0);
		}
	} else {
		for(int i = 0; i < arg_in_len; i++) {
			arg_out[i] = zdsp_q15_to_f32_shift(arg_in_tmp[i], 0);
		}
	}

	switch(ll_fn) {
		case LL_CORDIC_FUNCTION_MODULUS:
			arg_out[1] = PI_F32 * arg_out[1];
			break;
		case LL_CORDIC_FUNCTION_PHASE:
			arg_out[0] = PI_F32 * arg_out[0];
			break;
		case LL_CORDIC_FUNCTION_COSINE:
			break;
		case LL_CORDIC_FUNCTION_SINE:
			break;
		case LL_CORDIC_FUNCTION_ARCTANGENT:
			for(int i = 0; i < arg_in_len; i++) {
				/* Multiply by 2^scale */
				arg_out[i] = PI_F32 * arg_out[i] * (1 << ll_scale2scale(ll_scale));
			}
			break;
		case LL_CORDIC_FUNCTION_NATURALLOG:
			for(int i = 0; i < arg_in_len; i++) {
				/* Multiply by 2^(scale+1) */
				arg_out[i] = arg_out[i] * (1 << (ll_scale2scale(ll_scale) + 1));
			}
			break;
		case LL_CORDIC_FUNCTION_SQUAREROOT:
			break;
		case LL_CORDIC_FUNCTION_HARCTANGENT:
		case LL_CORDIC_FUNCTION_HCOSINE:
		case LL_CORDIC_FUNCTION_HSINE:
			for(int i = 0; i < arg_in_len; i++) {
				/* Multiply by 2^scale */
				arg_out[i] = arg_out[i] * (1 << ll_scale2scale(ll_scale));
			}
			break;
		default:
			return -EINVAL;
	}

	return ret;
}

static void before_fn(void* data)
{
	ARG_UNUSED(data);
	zassert_true(device_is_ready(cordic_dev), "CORDIC device not ready");
}

static void after_fn(void* data)
{
	ARG_UNUSED(data);
}

static void run_test_case(const float *args_in,
						  const size_t args_len,
						  const float *exp_res,
						  const size_t res_len,
						  const double residual_error)
{
	int args[args_len];
	int res[res_len];
	float res_float[res_len];
	int ret = 0;

	ret = stm32_cordic_float2fixed(args_in, args, args_len, args_len);
	zassert_equal(ret, 0, "CORDIC stm32_cordic_float2fixed failed: %d", ret);

