zephyrproject-rtos/zephyr/tests/drivers/cordic/cordic_api/src/test_stm32_cordic.c
	ret = cordic_compute(cordic_dev, args, args_len);
	zassert_equal(ret, 0, "cordic_compute failed: %d", ret);

	ret = cordic_read_result(cordic_dev, res, res_len);
	zassert_equal(ret, 0, "cordic_read_result failed: %d", ret);

	ret = stm32_cordic_fixed2float(res, res_float, res_len, res_len);
	zassert_equal(ret, 0, "CORDIC stm32_cordic_fixed2float failed: %d", ret);

	for(int j = 0; j < res_len; j++) {
		zassert_true(cordic_float_close(res_float[j], exp_res[j], residual_error),
			"CORDIC result out of range: val: %f expected: %f residual error: %f",
			(double)res_float[j], (double)exp_res[j], (double)residual_error);
	}
}

/**
 * @brief Test CORDIC Configure function. This test is allowed to apply some
 * arbitrary configuration.
 */
ZTEST(stm32_cordic, test_cordic_configure_function)
{
	struct cordic_config config = {
		.function = CORDIC_FUNC_SINE,
		.precision = CORDIC_PRECISION_1,
		.scale = CORDIC_DATA_SCALE_3,
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};
	int ret = 0;

	const enum cordic_function fn_list[] = {
		CORDIC_FUNC_COSINE,
		CORDIC_FUNC_SINE,
		CORDIC_FUNC_PHASE,
		CORDIC_FUNC_MODULUS,
		CORDIC_FUNC_ARCTANGENT,
		CORDIC_FUNC_HCOSINE,
		CORDIC_FUNC_HSINE,
		CORDIC_FUNC_HARCTANGENT,
		CORDIC_FUNC_NATURALLOG,
		CORDIC_FUNC_SQUAREROOT,
	};

	const uint32_t mapped_fn_list[] = {
		LL_CORDIC_FUNCTION_COSINE,
		LL_CORDIC_FUNCTION_SINE,
		LL_CORDIC_FUNCTION_PHASE,
		LL_CORDIC_FUNCTION_MODULUS,
		LL_CORDIC_FUNCTION_ARCTANGENT,
		LL_CORDIC_FUNCTION_HCOSINE,
		LL_CORDIC_FUNCTION_HSINE,
		LL_CORDIC_FUNCTION_HARCTANGENT,
		LL_CORDIC_FUNCTION_NATURALLOG,
		LL_CORDIC_FUNCTION_SQUAREROOT,
	};

	/* Iterate through all possible function configurations */
	for(int i = 0; i < ARRAY_SIZE(fn_list); i++) {
		config.function = fn_list[i];
		ret = cordic_configure(cordic_dev, &config);
		zassert_equal(ret, 0, "%s: CORDIC function configure failed: %d",
				cordic_dev->name, ret);
		const uint32_t ll_fn = LL_CORDIC_GetFunction(CORDIC_LL_DEV);
		zassert_equal(ll_fn, mapped_fn_list[i],
				"%s: CORDIC function 0x%x != 0x%x (expected_fn != current_fn)"
				": CORDIC.CSR: 0x%x",
				cordic_dev->name, mapped_fn_list[i], ll_fn,
				CORDIC_LL_DEV->CSR);

		/* Verify number of argumernts an results */
		const uint32_t ll_nargs = LL_CORDIC_GetNbWrite(CORDIC_LL_DEV);
		const uint32_t ll_nres = LL_CORDIC_GetNbRead(CORDIC_LL_DEV);
		const uint32_t ll_in_width = LL_CORDIC_GetInSize(CORDIC_LL_DEV);
		const uint32_t ll_out_width = LL_CORDIC_GetOutSize(CORDIC_LL_DEV);

		const uint32_t ll_scale = LL_CORDIC_GetScale(CORDIC_LL_DEV);
		zassert_equal(ll_scale, LL_CORDIC_SCALE_3,
				"%s: CORDIC scale 0x%x != 0x%x (expected_scale != current_scale)",
				cordic_dev->name, LL_CORDIC_SCALE_3, ll_scale);


		if(ll_fn == CORDIC_FUNC_COSINE || ll_fn == CORDIC_FUNC_SINE ||
		   ll_fn == CORDIC_FUNC_PHASE || ll_fn == CORDIC_FUNC_MODULUS) {
			const uint32_t nargs_expected = ll_in_width == LL_CORDIC_INSIZE_32BITS ?
							LL_CORDIC_NBWRITE_2 : LL_CORDIC_NBWRITE_1;
			const uint32_t nres_expected = ll_out_width == LL_CORDIC_OUTSIZE_32BITS ?
						       LL_CORDIC_NBREAD_2 : LL_CORDIC_NBREAD_1;
			zassert_equal(ll_nargs, nargs_expected,
				"%s: CORDIC nargs 0x%x != 0x%x (expected_nargs != current_nargs)"
				": CORDIC.CSR: 0x%x",
				cordic_dev->name, nargs_expected, ll_nargs,
				CORDIC_LL_DEV->CSR);
			zassert_equal(ll_nres, nres_expected,
				"%s: CORDIC nres 0x%x != 0x%x (expected_nres != current_nres)"
				": CORDIC.CSR: 0x%x",
				cordic_dev->name, nres_expected, ll_nres,
				CORDIC_LL_DEV->CSR);

		} else if(ll_fn == CORDIC_FUNC_ARCTANGENT || ll_fn == CORDIC_FUNC_HARCTANGENT ||
			  ll_fn == CORDIC_FUNC_NATURALLOG || ll_fn == CORDIC_FUNC_SQUAREROOT) {
			zassert_equal(ll_nargs, LL_CORDIC_NBWRITE_1,
				"%s: CORDIC nargs 0x%x != 0x%x (expected_nargs != current_nargs)"
				": CORDIC.CSR: 0x%x",
				cordic_dev->name, LL_CORDIC_NBWRITE_1, ll_nargs,
				CORDIC_LL_DEV->CSR);
			zassert_equal(ll_nres, LL_CORDIC_NBREAD_1,
				"%s: CORDIC nres 0x%x != 0x%x (expected_nres != current_nres)"
				": CORDIC.CSR: 0x%x",
				cordic_dev->name, LL_CORDIC_NBREAD_1, ll_nres,
				CORDIC_LL_DEV->CSR);
		} else {
			zassert_equal(ll_nargs, LL_CORDIC_NBWRITE_1,
				"%s: CORDIC nargs 0x%x != 0x%x (expected_nargs != current_nargs)"
				": CORDIC.CSR: 0x%x",
				cordic_dev->name, LL_CORDIC_NBWRITE_1, ll_nargs,
				CORDIC_LL_DEV->CSR);
			const uint32_t nres_expected = ll_out_width == LL_CORDIC_OUTSIZE_32BITS ?
						       LL_CORDIC_NBREAD_2 : LL_CORDIC_NBREAD_1;
			zassert_equal(ll_nres, nres_expected,
				"%s: CORDIC nres 0x%x != 0x%x (expected_nres != current_nres)"
				": CORDIC.CSR: 0x%x",
				cordic_dev->name, nres_expected, ll_nres,
				CORDIC_LL_DEV->CSR);
	}
	}
}

/**
 * @brief Test CORDIC Configure precision. This test is allowed to apply some
 * arbitrary configuration.
 */
ZTEST(stm32_cordic, test_cordic_configure_precision)
{
	struct cordic_config config = {
		.function = CORDIC_FUNC_SINE,
		.precision = CORDIC_PRECISION_1,
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};
	int ret = 0;

	const enum cordic_precision prec_list[] = {
		CORDIC_PRECISION_1,
		CORDIC_PRECISION_2,
		CORDIC_PRECISION_3,
		CORDIC_PRECISION_4,
		CORDIC_PRECISION_5,
		CORDIC_PRECISION_6,
		CORDIC_PRECISION_7,
		CORDIC_PRECISION_8,
		CORDIC_PRECISION_9,
		CORDIC_PRECISION_10,
		CORDIC_PRECISION_11,
		CORDIC_PRECISION_12,
		CORDIC_PRECISION_13,
		CORDIC_PRECISION_14,
		CORDIC_PRECISION_4,
	};

	const uint32_t mapped_prec_list[] = {
		LL_CORDIC_PRECISION_1CYCLE,
		LL_CORDIC_PRECISION_2CYCLES,
		LL_CORDIC_PRECISION_3CYCLES,
		LL_CORDIC_PRECISION_4CYCLES,
		LL_CORDIC_PRECISION_5CYCLES,
		LL_CORDIC_PRECISION_6CYCLES,
		LL_CORDIC_PRECISION_7CYCLES,
		LL_CORDIC_PRECISION_8CYCLES,
		LL_CORDIC_PRECISION_9CYCLES,
		LL_CORDIC_PRECISION_10CYCLES,
		LL_CORDIC_PRECISION_11CYCLES,
		LL_CORDIC_PRECISION_12CYCLES,
		LL_CORDIC_PRECISION_13CYCLES,
		LL_CORDIC_PRECISION_14CYCLES,
		LL_CORDIC_PRECISION_4CYCLES,
	};

