zephyrproject-rtos/zephyr/tests/drivers/cordic/cordic_api/src/test_stm32_cordic.c
	/* Iterate through all possible precision configurations */
	for(int i = 0; i < ARRAY_SIZE(prec_list); i++) {
		config.precision = prec_list[i];
		ret = cordic_configure(cordic_dev, &config);
		zassert_equal(ret, 0, "CORDIC precision configure failed: %d", ret);
		const uint32_t ll_prec = LL_CORDIC_GetPrecision(CORDIC_LL_DEV);
		zassert_equal(ll_prec, mapped_prec_list[i],
				"%s: CORDIC precision 0x%x != 0x%x (expected_prec != current_prec)",
				cordic_dev->name, mapped_prec_list[i], ll_prec);
	}
}

/**
 * @brief Test CORDIC Configure data width. This test is allowed to apply some
 * arbitrary configuration.
 */
ZTEST(stm32_cordic, test_cordic_configure_data_width)
{
	struct cordic_config config = {
		.function = CORDIC_FUNC_SINE,
		.precision = CORDIC_PRECISION_1,
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};
	int ret = 0;

	const enum cordic_data_width data_width_list[] = {
		CORDIC_DATA_WIDTH_32BIT,
		CORDIC_DATA_WIDTH_16BIT,
	};

	const uint32_t mapped_in_width_list[] = {
		LL_CORDIC_INSIZE_32BITS,
		LL_CORDIC_INSIZE_16BITS,
	};

	/* Iterate through all possible input data width configurations for
	 * input size.
	 */
	for(int i = 0; i < ARRAY_SIZE(data_width_list); i++) {
		config.in_width = data_width_list[i];
		ret = cordic_configure(cordic_dev, &config);
		zassert_equal(ret, 0, "CORDIC input data width configure failed: %d", ret);
		const uint32_t ll_in_width = LL_CORDIC_GetInSize(CORDIC_LL_DEV);
		zassert_equal(ll_in_width, mapped_in_width_list[i],
				"%s: CORDIC input size 0x%x != 0x%x (expected_in_width != current_in_width)",
				cordic_dev->name, mapped_in_width_list[i], ll_in_width);
	}

	const uint32_t mapped_out_width_list[] = {
		LL_CORDIC_OUTSIZE_32BITS,
		LL_CORDIC_OUTSIZE_16BITS,
	};

	/* Iterate through all possible input data width configurations for
	 * output size.
	 */
	for(int i = 0; i < ARRAY_SIZE(data_width_list); i++) {
		config.out_width = data_width_list[i];
		ret = cordic_configure(cordic_dev, &config);
		zassert_equal(ret, 0, "CORDIC output data width configure failed: %d", ret);
		const uint32_t ll_out_width = LL_CORDIC_GetOutSize(CORDIC_LL_DEV);
		zassert_equal(ll_out_width, mapped_out_width_list[i],
				"%s: CORDIC output size 0x%x != 0x%x (expected_out_width != current_out_width)",
				cordic_dev->name, mapped_out_width_list[i], ll_out_width);
	}
}

/**
 * @brief Test CORDIC Phase function: Q31 numbers format.
 */
ZTEST(stm32_cordic, test_phase_q31)
{
	/* Input arguments */
	const float input_args[][2] = {
		{1.0f, 0.0f},
		{0.5f, 0.5f},
		{0.5f, 0.25f},
	}; // {x, y} coordinates in radians

	/* Expected results */
	const float exp_res[][2] = {
		{0.0f, 1.0f},
		{0.785398f, 0.707107f},
		{0.463648f, 0.559017f},
	}; // {atan2(y,x), modulus: m = sqrt(x^2 + y^2)}

	/* Q31 numbers format */
	struct cordic_config config = {
		.function = CORDIC_FUNC_PHASE,
		.precision = CORDIC_PRECISION_4,
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 2, exp_res[i], 2, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Phase function: Q15 numbers format.
 */
ZTEST(stm32_cordic, test_phase_q15)
{
	/* Input arguments */
	const float input_args[][2] = {
		{1.0f, 0.0f},
		{0.5f, 0.5f},
		{0.5f, 0.25f},
	}; // {x, y} coordinates in radians

	/* Expected results */
	const float exp_res[][2] = {
		{0.0f, 1.0f},
		{0.785398f, 0.707107f},
		{0.463648f, 0.559017f},
	}; // {atan2(y,x), modulus: m = sqrt(x^2 + y^2)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_PHASE,
		.precision = CORDIC_PRECISION_4,
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 2, exp_res[i], 2, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Modulus and Phase functions: Q31 numbers format.
 */
ZTEST(stm32_cordic, test_modulus_q31)
{
	const float input_args[][2] = {
		{0.456f, 0.123f},
		{0.123f, 0.456f},
		{1.0f, 0.0f},
		{0.0f, 1.0f},
	}; // {x, y}
	const float exp_res[][2] = {
		{0.472298f, 0.26346653f},
		{0.472298f, 1.3073297f},
		{1.0f, 0.0f},
		{1.0f, 1.57079633f},
	}; // {modulus: m = sqrt(x^2 + y^2), phase angle: atan2(y,x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_MODULUS,
		.precision = CORDIC_PRECISION_4,
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 2, exp_res[i], 2, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Modulus and Phase functions: Q15 numbers format.
 */
ZTEST(stm32_cordic, test_modulus_q15)
{
	const float input_args[][2] = {
		{0.456f, 0.123f},
		{0.123f, 0.456f},
		{1.0f, 0.0f},
		{0.0f, 1.0f},
	}; // {x, y}
	const float exp_res[][2] = {
		{0.472298f, 0.26346653f},
		{0.472298f, 1.3073297f},
		{1.0f, 0.0f},
		{1.0f, 1.57079633f},
	}; // {modulus: m = sqrt(x^2 + y^2), phase angle: atan2(y,x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_MODULUS,
		.precision = CORDIC_PRECISION_4,
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 2, exp_res[i], 2, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Square Root function: Q31 numbers format.
 */
ZTEST(stm32_cordic, test_sqrt_q31)
{
	const float input_args[][2] = {
		{0.027f},
		{0.25f},
		{0.74f},
	};
	const float exp_res[][2] = {
		{0.16431676725154984f},
		{0.5f},
		{0.8602325267042626f}
	};

	struct cordic_config config = {
		.function = CORDIC_FUNC_SQUAREROOT,
		.precision = CORDIC_PRECISION_4,
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

