zephyrproject-rtos/zephyr/tests/drivers/cordic/cordic_api/src/test_stm32_cordic.c
	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 1, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Square Root function: Q15 numbers format.
 */
ZTEST(stm32_cordic, test_sqrt_q15)
{
	const float input_args[][2] = {
		{0.027f},
		{0.25f},
		{0.74f},
	};
	const float exp_res[][2] = {
		{0.16431677f},
		{0.5f},
		{0.86023253f}
	};

	struct cordic_config config = {
		.function = CORDIC_FUNC_SQUAREROOT,
		.precision = CORDIC_PRECISION_4,
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 1, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Natural Logarithm function: Q31 numbers format.
 */
ZTEST(stm32_cordic, test_ln_q31)
{
	const float input_args[][2] = {
		{0.107f},
		{0.5f},
		{0.95f},
	};
	const float exp_res[][2] = {
		{-2.23492644452f},
		{-0.69314718f},
		{-0.051293f},
	};

	struct cordic_config config = {
		.function = CORDIC_FUNC_NATURALLOG,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_1,
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 1, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Natural Logarithm function: Q15 numbers format.
 */
ZTEST(stm32_cordic, test_ln_q15)
{
	const float input_args[][2] = {
		{0.107f},
		{0.5f},
		{0.95f},
	};
	const float exp_res[][2] = {
		{-2.23492644452f},
		{-0.69314718f},
		{-0.051293f},
	};

	struct cordic_config config = {
		.function = CORDIC_FUNC_NATURALLOG,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_1,
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 1, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Cosine function: Q31 numbers format.
 */
ZTEST(stm32_cordic, test_cosine_q31)
{
	const float input_args[][2] = {
		{PI_F32/2.0f, 0.25f},
		{PI_F32, 0.5f},
		{PI_F32/4.0f, 0.1f},
	}; // {x - angle in radians, y - modulus}
	const float exp_res[][2] = {
		{0.0f, 0.25f},
		{-0.5f, 0.0f},
		{0.0707107f, 0.0707107f},
	}; // {y * cos(x), y * sin(x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_COSINE,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_0,  /* not applicable */
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 2, exp_res[i], 2, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Cosine function: Q15 numbers format.
 */
ZTEST(stm32_cordic, test_cosine_q15)
{
	const float input_args[][2] = {
		{PI_F32/2.0f, 0.25f},
		{PI_F32, 0.5f},
		{PI_F32/4.0f, 0.1f},
	}; // {x - angle in radians, y - modulus}
	const float exp_res[][2] = {
		{0.0f, 0.25f},
		{-0.5f, 0.0f},
		{0.0707107f, 0.0707107f},
	}; // {y * cos(x), y * sin(x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_COSINE,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_0,  /* not applicable */
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 2, exp_res[i], 2, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Sine function: Q31 numbers format.
 */
ZTEST(stm32_cordic, test_sine_q31)
{
	const float input_args[][2] = {
		{PI_F32/2.0f, 0.25f},
		{PI_F32, 0.5f},
		{PI_F32/4.0f, 0.1f},
	}; // {x - angle in radians, y - modulus}
	const float exp_res[][2] = {
		{0.25f, 0.0f},
		{0.0f, -0.5f},
		{0.0707107f, 0.0707107f},
	}; // {y * sin(x), y * cos(x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_SINE,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_0,  /* not applicable */
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 2, exp_res[i], 2, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Sine function: Q15 numbers format.
 */
ZTEST(stm32_cordic, test_sine_q15)
{
	const float input_args[][2] = {
		{PI_F32/2.0f, 0.25f},
		{PI_F32, 0.5f},
		{PI_F32/4.0f, 0.1f},
	}; // {x - angle in radians, y - modulus}
	const float exp_res[][2] = {
		{0.25f, 0.0f},
		{0.0f, -0.5f},
		{0.0707107f, 0.0707107f},
	}; // {y * sin(x), y * cos(x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_SINE,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_0,  /* not applicable */
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 2, exp_res[i], 2, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Hyperbolic cosine function: Q31 numbers format.
 */
ZTEST(stm32_cordic, test_hcosine_q31)
{
	const float input_args[][2] = {
		{-0.559f},
		{0.25f},
		{0.559f},
	}; // {x}
	const float exp_res[][2] = {
		{1.16035163f, -0.58857107f},
		{1.0314131f, 0.25261232f},
		{1.16035163f, 0.58857107f},
	}; // {cosh(x), sinh(x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_HCOSINE,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_1,  /* the only scale is 1 */
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

