zephyrproject-rtos/zephyr/tests/drivers/cordic/cordic_api/src/test_stm32_cordic.c
	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 2, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Hyperbolic cosine function: Q15 numbers format.
 */
ZTEST(stm32_cordic, test_hcosine_q15)
{
	const float input_args[][2] = {
		{-0.559f},
		{0.25f},
		{0.559f},
	}; // {x}
	const float exp_res[][2] = {
		{1.16035163f, -0.58857107f},
		{1.0314131f, 0.25261232f},
		{1.16035163f, 0.58857107f},
	}; // {cosh(x), sinh(x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_HCOSINE,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_1,  /* the only scale is 1 */
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 2, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Hyperbolic sine function: Q31 numbers format.
 */
ZTEST(stm32_cordic, test_hsine_q31)
{
	const float input_args[][2] = {
		{-0.559f},
		{0.25f},
		{0.559f},
	}; // {x}
	const float exp_res[][2] = {
		{-0.58857107f, 1.16035163f},
		{0.25261232f, 1.0314131f},
		{0.58857107f, 1.16035163f},
	}; // {sinh(x), cosh(x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_HSINE,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_1,  /* the only scale is 1 */
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 2, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Hyperbolic sine function: Q15 numbers format.
 */
ZTEST(stm32_cordic, test_hsine_q15)
{
	const float input_args[][2] = {
		{-0.559f},
		{0.25f},
		{0.559f},
	}; // {x}
	const float exp_res[][2] = {
		{-0.58857107f, 1.16035163f},
		{0.25261232f, 1.0314131f},
		{0.58857107f, 1.16035163f},
	}; // {sinh(x), cosh(x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_HSINE,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_1,  /* the only scale is 1 */
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 2, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Arctangent function: Q31 numbers format.
 */
ZTEST(stm32_cordic, test_arctangent_q31)
{
	const float input_args[][2] = {
		{-1.0f},
		{0.5f},
		{1.0f},
	}; // {x}
	const float exp_res[][2] = {
		{-0.78539816339f},
		{0.4636476090f},
		{0.78539816339f},
	}; // {atan(x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_ARCTANGENT,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_1,
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 1, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Arctangent function: Q15 numbers format.
 */
ZTEST(stm32_cordic, test_arctangent_q15)
{
	const float input_args[][2] = {
		{-1.0f},
		{0.5f},
		{1.0f},
	}; // {x}
	const float exp_res[][2] = {
		{-0.78539816339f},
		{0.4636476090f},
		{0.78539816339f},
	}; // {atan(x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_ARCTANGENT,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_1,
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 1, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Hyperbolic Arctangent function: Q31 numbers format.
 */
ZTEST(stm32_cordic, test_harctangent_q31)
{
	const float input_args[][2] = {
		{-0.403f},
		{-0.1f},
		{0.0f},
		{0.25f},
		{0.403f}
	}; // {x}
	const float exp_res[][2] = {
		{-0.42722548f},
		{-0.10033535f},
		{0.0f},
		{0.25541281f},
		{0.42722548f}
	}; // {atanh(x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_HARCTANGENT,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_1, /* the only scale is 1 */
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 1, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC Hyperbolic Arctangent function: Q15 numbers format.
 */
ZTEST(stm32_cordic, test_harctangent_q15)
{
	const float input_args[][2] = {
		{-0.403f},
		{-0.1f},
		{0.0f},
		{0.25f},
		{0.403f}
	}; // {x}
	const float exp_res[][2] = {
		{-0.42722548f},
		{-0.10033535f},
		{0.0f},
		{0.25541281f},
		{0.42722548f}
	}; // {atanh(x)}

	struct cordic_config config = {
		.function = CORDIC_FUNC_HARCTANGENT,
		.precision = CORDIC_PRECISION_4,
		.scale = CORDIC_DATA_SCALE_1, /* the only scale is 1 */
		.in_width = CORDIC_DATA_WIDTH_16BIT,
		.out_width = CORDIC_DATA_WIDTH_16BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 1, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC read zero-overhead mode
 */
ZTEST(stm32_cordic, test_read_zero_overhead)
{
	const float input_args[][2] = {
		{0.25f},
	};
	const float exp_res[][2] = {
		{0.5f},
	};

	const struct cordic_config_options stm32_options = {
		.data_mode = STM32_CORDIC_DATA_MODE_ZERO_OVERHEAD,
	};

	struct cordic_config config = {
		.function = CORDIC_FUNC_SQUAREROOT,
		.precision = CORDIC_PRECISION_4,
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
		.options = &stm32_options,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

