zephyrproject-rtos/zephyr/tests/drivers/cordic/cordic_api/src/test_stm32_cordic.c
	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 1, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC read polling mode
 */
ZTEST(stm32_cordic, test_read_polling)
{
	const float input_args[][2] = {
		{0.49f},
		{0.25f},
	};
	const float exp_res[][2] = {
		{0.7f},
		{0.5f},
	};

	const struct cordic_config_options stm32_options = {
		.data_mode = STM32_CORDIC_DATA_MODE_POLLING,
	};

	struct cordic_config config = {
		.function = CORDIC_FUNC_SQUAREROOT,
		.precision = CORDIC_PRECISION_4,
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
		.options = &stm32_options,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	for(int i = 0; i < ARRAY_SIZE(input_args); i++) {
		run_test_case(input_args[i], 1, exp_res[i], 1, RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC read interrupt mode
 */
ZTEST(stm32_cordic, test_read_interrupt)
{
	const float input_args[][1] = {
		{0.16f},
	};
	const float exp_res[][1] = {
		{0.4f},
	};

	const struct cordic_config_options stm32_options = {
		.data_mode = STM32_CORDIC_DATA_MODE_INTERRUPT,
	};

	struct cordic_config config = {
		.function = CORDIC_FUNC_SQUAREROOT,
		.precision = CORDIC_PRECISION_4,
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
		.options = &stm32_options,
		.callback = test_cordic_read_result_callback,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	const size_t args_len = 1;
	const size_t res_len = 1;

	int args[args_len];
	int res[res_len];
	float res_float[res_len];

	ret = stm32_cordic_float2fixed(input_args[0], args, args_len, args_len);
	zassert_equal(ret, 0, "CORDIC stm32_cordic_float2fixed failed: %d", ret);

	atomic_set(&test_cordic_read_result_callback_call_cnt, 0);

	ret = cordic_compute(cordic_dev, args, args_len);
	zassert_equal(ret, 0, "cordic_compute failed: %d", ret);

	k_msleep(10); /* wait for the callback to be called */

	/* Verify callback call count */
	const atomic_t cb_call_cnt = atomic_get(&test_cordic_read_result_callback_call_cnt);
	zassert_equal(cb_call_cnt, 1, "Expected callback call count beeing 1, but it is %ld", cb_call_cnt);

	/* Verify result from callback */
	ret = stm32_cordic_fixed2float(results_from_callback, res_float,
								   RESULTS_FROM_CALLBACK_LEN, res_len);
	zassert_equal(ret, 0, "CORDIC stm32_cordic_fixed2float failed: %d", ret);

	for(int j = 0; j < res_len; j++) {
		zassert_true(cordic_float_close(res_float[j], exp_res[0][j], RESIDUAL_ERROR),
			"CORDIC result out of range: val: %f expected: %f residual error: %f",
			(double)res_float[j], (double)exp_res[0][j], (double)RESIDUAL_ERROR);
	}

	/* Verify result by read function are still in registers */
	ret = cordic_read_result(cordic_dev, res, res_len);
	zassert_equal(ret, 0, "cordic_read_result failed: %d", ret);

	ret = stm32_cordic_fixed2float(res, res_float, res_len, res_len);
	zassert_equal(ret, 0, "CORDIC stm32_cordic_fixed2float failed: %d", ret);

	for(int j = 0; j < res_len; j++) {
		zassert_true(cordic_float_close(res_float[j], exp_res[0][j], RESIDUAL_ERROR),
			"CORDIC result out of range: val: %f expected: %f residual error: %f",
			(double)res_float[j], (double)exp_res[0][j], (double)RESIDUAL_ERROR);
	}
}

/**
 * @brief Test CORDIC DMA Memory-to-Memory Sine function: Q31 numbers format.
 */
ZTEST(stm32_cordic, test_dma_mem2mem_sine_q31)
{
#define nsamp	4  /* number of samples */
#define nargs	2  /* number of arguments per sample */

	const float input_args[nsamp][nargs] = {
		/* {x - angle in radians, y - modulus} */
		{PI_F32/2.00f, 0.25f},
		{PI_F32, 0.50f},
		{PI_F32/4.0f, 0.10f},
		{PI_F32/7.0f, 0.15f},
	};

	const float exp_res[nsamp][nargs] = {
		/* {y * sin(x), y * cos(x)} */
		{0.25f * 1.0f, 0.25f *  0.0f},
		{0.50f * 0.0f, 0.50f * -1.0f},
		{0.10f * 0.707107f, 0.10f * 0.707107f},
		{0.15f * 0.433883f, 0.15f * 0.900968f},
	};

	const struct cordic_config_options stm32_options = {
		.data_mode = STM32_CORDIC_DATA_MODE_DMA,
	};

	struct cordic_config config = {
		.function = CORDIC_FUNC_SINE,
		.precision = CORDIC_PRECISION_4,
		.options = &stm32_options,
		.scale = CORDIC_DATA_SCALE_0,  /* not applicable for sine */
		.in_width = CORDIC_DATA_WIDTH_32BIT,
		.out_width = CORDIC_DATA_WIDTH_32BIT,
	};

	int ret = cordic_configure(cordic_dev, &config);
	zassert_equal(ret, 0, "CORDIC configure failed: %d", ret);

	static int args_buff[nsamp][nargs];
	static int res_buff[nsamp][nargs];
	float res_float[nsamp][nargs];

	for(size_t ns = 0; ns < nsamp; ns++) {
		ret = stm32_cordic_float2fixed(input_args[ns], args_buff[ns], nargs, nargs);
		zassert_equal(ret, 0, "CORDIC stm32_cordic_float2fixed failed: %d", ret);
	}

	/* Configure write DMA channel: memory -> CORDIC WDATA (M2P) */
	static struct dma_block_config cordic_dma_wr_block = {
		.source_address = (uint32_t)args_buff,
		.source_addr_adj = DMA_ADDR_ADJ_INCREMENT,

		.dest_address    = (uintptr_t)&CORDIC_LL_DEV->WDATA,  /* TODO: cordic api shall have wdata phys address getter */
		.dest_addr_adj   = DMA_ADDR_ADJ_NO_CHANGE,

		.block_size = nsamp * nargs * 4,  /* 4 bytes each */

		.source_reload_en = 0U,
		.dest_reload_en   = 0U,
	};

	static struct dma_config dma_wr_cfg = {
		.dma_slot            = cordic_dma_wr_slot,
		.channel_direction   = MEMORY_TO_PERIPHERAL,
		.source_data_size    = 4U,
		.dest_data_size      = 4U,
		// .source_burst_length = 4U,
		// .dest_burst_length   = 4U,
		.block_count         = 1U,
		// .channel_priority    = 0U,
		.head_block          = &cordic_dma_wr_block,
		.user_data           = (void *)cordic_dma_wr_dev,
		// .dma_callback
		/* No completion callback: the read channel drives overall completion */
	};

	/* Configure read DMA channel: CORDIC RDATA -> memory (P2M) */
	static struct dma_block_config cordic_dma_rd_block = {
		.source_address = (uintptr_t)&CORDIC_LL_DEV->RDATA,  /* TODO: cordic api shall have rdata phys address getter */
		.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

		.dest_address = (uint32_t)res_buff,
		.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT,

