zephyrproject-rtos/zephyr/tests/drivers/cordic/cordic_api/src/test_stm32_cordic.c
		// .dest_address    = (uintptr_t)&CORDIC_LL_DEV->WDATA,  /* TODO: cordic api shall have wdata phys address getter */
		// .dest_addr_adj   = DMA_ADDR_ADJ_NO_CHANGE,

		.block_size = nsamp * nargs * 4,  /* 2 words of 4 bytes each */

		.source_reload_en = 0U,
		.dest_reload_en   = 0U,
	};

	static struct dma_config dma_rd_cfg = {
		.dma_slot            = cordic_dma_rd_slot,
		.channel_direction   = PERIPHERAL_TO_MEMORY,
		.source_data_size    = 4U,
		.dest_data_size      = 4U,
		// .source_burst_length = 4U,
		// .dest_burst_length   = 4U,
		.block_count         = 1U,
		// .channel_priority    = 0U,
		.head_block          = &cordic_dma_rd_block,
		.user_data           = (void *)cordic_dma_rd_dev,
		// .dma_callback
		/* No completion callback: the read channel drives overall completion */
	};

	ret = dma_stop(cordic_dma_wr_dev, cordic_dma_wr_channel);
	zassert_equal(ret, 0, "%s: DMA write stop failed: %d", cordic_dma_wr_dev->name, ret);

	ret = dma_stop(cordic_dma_rd_dev, cordic_dma_rd_channel);
	zassert_equal(ret, 0, "%s: DMA read stop failed: %d", cordic_dma_rd_dev->name, ret);

	ret = dma_config(cordic_dma_rd_dev, cordic_dma_rd_channel, &dma_rd_cfg);
	zassert_equal(ret, 0, "%s: DMA read config failed: %d", cordic_dma_rd_dev->name, ret);

	ret = dma_config(cordic_dma_wr_dev, cordic_dma_wr_channel, &dma_wr_cfg);
	zassert_equal(ret, 0, "%s: DMA write config failed: %d", cordic_dma_wr_dev->name, ret);

	ret = dma_start(cordic_dma_rd_dev, cordic_dma_rd_channel);
	zassert_equal(ret, 0, "%s: DMA read start failed: %d", cordic_dma_rd_dev->name, ret);

	ret = dma_start(cordic_dma_wr_dev, cordic_dma_wr_channel);
	zassert_equal(ret, 0, "%s: DMA write start failed: %d", cordic_dma_wr_dev->name, ret);

	k_msleep(1); /* wait for the callback to be called */

	ret = dma_stop(cordic_dma_wr_dev, cordic_dma_wr_channel);
	zassert_equal(ret, 0, "%s: DMA write stop failed: %d", cordic_dma_wr_dev->name, ret);

	ret = dma_stop(cordic_dma_rd_dev, cordic_dma_rd_channel);
	zassert_equal(ret, 0, "%s: DMA read stop failed: %d", cordic_dma_rd_dev->name, ret);

	/* Convert results from fixed point format to floating point */
	for(size_t ns = 0; ns < nsamp; ns++) {
		ret = stm32_cordic_fixed2float(res_buff[ns], res_float[ns], nargs, nargs);
		zassert_equal(ret, 0, "CORDIC stm32_cordic_fixed2float failed: %d", ret);
	}

	/* Verify computed results against expected ones*/
	for(size_t ns = 0; ns < nsamp; ns++) {
		for(size_t na = 0; na < nargs; na++) {
			zassert_true(cordic_float_close(res_float[ns][na], exp_res[ns][na], RESIDUAL_ERROR),
				"CORDIC result (%d,%d) out of range: val: %f expected: %f residual error: %f",
				ns, na, (double)res_float[ns][na], (double)exp_res[ns][na], (double)RESIDUAL_ERROR);
		}
	}
}

ZTEST_SUITE(stm32_cordic, NULL, NULL, before_fn, after_fn, NULL);
